verylowfreq/arduino_core_ch32_sz/boards.txt
#CH32V103R8T6 EVT Board    CH32V10x_3V3: 3.3V power supply  CH32V10x_5V: 5V power supply
CH32V10x_EVT.menu.pnum.CH32V103R8T6=CH32V103R8T6 EVT
CH32V10x_EVT.menu.pnum.CH32V103R8T6.node=NODE_V103R8T6
CH32V10x_EVT.menu.pnum.CH32V103R8T6.upload.maximum_size=65536
CH32V10x_EVT.menu.pnum.CH32V103R8T6.upload.maximum_data_size=20480
CH32V10x_EVT.menu.pnum.CH32V103R8T6.build.mcu=QingKe-V3A
CH32V10x_EVT.menu.pnum.CH32V103R8T6.build.board=CH32V103R8T6
CH32V10x_EVT.menu.pnum.CH32V103R8T6.build.series=CH32V10x
CH32V10x_EVT.menu.pnum.CH32V103R8T6.build.variant=CH32V10x/CH32V103R8T6
CH32V10x_EVT.menu.pnum.CH32V103R8T6.build.chip=CH32V10x_3V3
CH32V10x_EVT.menu.pnum.CH32V103R8T6.build.march=rv32imac
CH32V10x_EVT.menu.pnum.CH32V103R8T6.build.mabi=ilp32
CH32V10x_EVT.menu.pnum.CH32V103R8T6.build.math_lib_gcc=-lm 
CH32V10x_EVT.menu.pnum.CH32V103R8T6.build.IQ_math_RV32=
CH32V10x_EVT.menu.pnum.CH32V103R8T6.build.ch_extra_lib=-lprintf                           


# Upload menu
CH32V10x_EVT.menu.upload_method.swdMethod=WCH-SWD
CH32V10x_EVT.menu.upload_method.swdMethod.upload.protocol=
CH32V10x_EVT.menu.upload_method.swdMethod.upload.options=
CH32V10x_EVT.menu.upload_method.swdMethod.upload.tool=WCH_linkE



# Optimizations
CH32V10x_EVT.menu.opt.osstd=Smallest (-Os default)
CH32V10x_EVT.menu.opt.osstd.build.flags.optimize=-Os 
CH32V10x_EVT.menu.opt.oslto=Smallest (-Os) with LTO
CH32V10x_EVT.menu.opt.oslto.build.flags.optimize=-Os -flto
CH32V10x_EVT.menu.opt.o1std=Fast (-O1)
CH32V10x_EVT.menu.opt.o1std.build.flags.optimize=-O1
CH32V10x_EVT.menu.opt.o1lto=Fast (-O1) with LTO
CH32V10x_EVT.menu.opt.o1lto.build.flags.optimize=-O1 -flto
CH32V10x_EVT.menu.opt.o2std=Faster (-O2)
CH32V10x_EVT.menu.opt.o2std.build.flags.optimize=-O2
CH32V10x_EVT.menu.opt.o2lto=Faster (-O2) with LTO
CH32V10x_EVT.menu.opt.o2lto.build.flags.optimize=-O2 -flto
CH32V10x_EVT.menu.opt.o3std=Fastest (-O3)
CH32V10x_EVT.menu.opt.o3std.build.flags.optimize=-O3
CH32V10x_EVT.menu.opt.o3lto=Fastest (-O3) with LTO
CH32V10x_EVT.menu.opt.o3lto.build.flags.optimize=-O3 -flto
CH32V10x_EVT.menu.opt.ogstd=Debug (-Og)
CH32V10x_EVT.menu.opt.ogstd.build.flags.optimize=-Og
CH32V10x_EVT.menu.opt.o0std=No Optimization (-O0)
CH32V10x_EVT.menu.opt.o0std.build.flags.optimize=-O0


# Debug information
CH32V10x_EVT.menu.dbg.none=None
CH32V10x_EVT.menu.dbg.none.build.flags.debug=-DNDEBUG 
CH32V10x_EVT.menu.dbg.enable_sym=Symbols Enabled (-g)
CH32V10x_EVT.menu.dbg.enable_sym.build.flags.debug=-g -DNDEBUG
CH32V10x_EVT.menu.dbg.enable_log=Core logs Enabled
CH32V10x_EVT.menu.dbg.enable_log.build.flags.debug=
CH32V10x_EVT.menu.dbg.enable_all=Core Logs and Symbols Enabled (-g)
CH32V10x_EVT.menu.dbg.enable_all.build.flags.debug=-g


# C Runtime Library
CH32V10x_EVT.menu.rtlib.nano=Newlib Nano (default)
CH32V10x_EVT.menu.rtlib.nano.build.flags.ldflags=--specs=nano.specs --specs=nosys.specs
CH32V10x_EVT.menu.rtlib.nanofp=Newlib Nano + Float Printf
CH32V10x_EVT.menu.rtlib.nanofp.build.flags.ldflags=--specs=nano.specs --specs=nosys.specs -u _printf_float
CH32V10x_EVT.menu.rtlib.nanofs=Newlib Nano + Float Scanf
CH32V10x_EVT.menu.rtlib.nanofs.build.flags.ldflags=--specs=nano.specs --specs=nosys.specs -u _scanf_float
CH32V10x_EVT.menu.rtlib.nanofps=Newlib Nano + Float Printf/Scanf
CH32V10x_EVT.menu.rtlib.nanofps.build.flags.ldflags=--specs=nano.specs --specs=nosys.specs -u _printf_float -u _scanf_float
CH32V10x_EVT.menu.rtlib.full=Newlib Standard
CH32V10x_EVT.menu.rtlib.full.build.flags.ldflags=--specs=nosys.specs






#############################################################################
##CH32V20x EVT Board

CH32V20x_EVT.name=CH32V20x
CH32V20x_EVT.build.core=arduino
CH32V20x_EVT.build.board=CH32V20x_EVT
CH32V20x_EVT.upload.maximum_size=0
CH32V20x_EVT.upload.maximum_data_size=0
CH32V20x_EVT.build.variant_h=variant_{build.board}.h


#CH32V203RB EVT Board
CH32V20x_EVT.menu.pnum.CH32V203RB=CH32V203RB EVT
CH32V20x_EVT.menu.pnum.CH32V203RB.node=NODE_V203RB
CH32V20x_EVT.menu.pnum.CH32V203RB.upload.maximum_size=131072
CH32V20x_EVT.menu.pnum.CH32V203RB.upload.maximum_data_size=65536
CH32V20x_EVT.menu.pnum.CH32V203RB.build.mcu=QingKe-V4B
CH32V20x_EVT.menu.pnum.CH32V203RB.build.board=CH32V203RB
CH32V20x_EVT.menu.pnum.CH32V203RB.build.series=CH32V20x
CH32V20x_EVT.menu.pnum.CH32V203RB.build.variant=CH32V20x/CH32V203RB
CH32V20x_EVT.menu.pnum.CH32V203RB.build.chip=CH32V203
CH32V20x_EVT.menu.pnum.CH32V203RB.build.march=rv32imacxw
CH32V20x_EVT.menu.pnum.CH32V203RB.build.mabi=ilp32
CH32V20x_EVT.menu.pnum.CH32V203RB.build.math_lib_gcc=-lm
CH32V20x_EVT.menu.pnum.CH32V203RB.build.IQ_math_RV32=
CH32V20x_EVT.menu.pnum.CH32V203RB.build.ch_extra_lib=-lprintf



#CH32V203G8 EVT Board
CH32V20x_EVT.menu.pnum.CH32V203G8=CH32V203G8 EVT
CH32V20x_EVT.menu.pnum.CH32V203G8.node=NODE_V203G8
CH32V20x_EVT.menu.pnum.CH32V203G8.upload.maximum_size=65536
CH32V20x_EVT.menu.pnum.CH32V203G8.upload.maximum_data_size=20480
CH32V20x_EVT.menu.pnum.CH32V203G8.build.mcu=QingKe-V4B
CH32V20x_EVT.menu.pnum.CH32V203G8.build.board=CH32V203G8
CH32V20x_EVT.menu.pnum.CH32V203G8.build.series=CH32V20x
CH32V20x_EVT.menu.pnum.CH32V203G8.build.variant=CH32V20x/CH32V203G8
CH32V20x_EVT.menu.pnum.CH32V203G8.build.chip=CH32V203
CH32V20x_EVT.menu.pnum.CH32V203G8.build.march=rv32imacxw
CH32V20x_EVT.menu.pnum.CH32V203G8.build.mabi=ilp32
CH32V20x_EVT.menu.pnum.CH32V203G8.build.math_lib_gcc=-lm 
CH32V20x_EVT.menu.pnum.CH32V203G8.build.IQ_math_RV32=
CH32V20x_EVT.menu.pnum.CH32V203G8.build.ch_extra_lib=-lprintf


#Generic CH32V203C8 Board
CH32V20x_EVT.menu.pnum.CH32V203C8=CH32V203C8
CH32V20x_EVT.menu.pnum.CH32V203C8.node=NODE_V203C8
CH32V20x_EVT.menu.pnum.CH32V203C8.upload.maximum_size=65536
CH32V20x_EVT.menu.pnum.CH32V203C8.upload.maximum_data_size=20480
CH32V20x_EVT.menu.pnum.CH32V203C8.build.mcu=QingKe-V4B
CH32V20x_EVT.menu.pnum.CH32V203C8.build.board=CH32V203C8
CH32V20x_EVT.menu.pnum.CH32V203C8.build.series=CH32V20x
CH32V20x_EVT.menu.pnum.CH32V203C8.build.variant=CH32V20x/CH32V203C8
CH32V20x_EVT.menu.pnum.CH32V203C8.build.chip=CH32V203
CH32V20x_EVT.menu.pnum.CH32V203C8.build.march=rv32imacxw
CH32V20x_EVT.menu.pnum.CH32V203C8.build.mabi=ilp32
CH32V20x_EVT.menu.pnum.CH32V203C8.build.math_lib_gcc=-lm 
CH32V20x_EVT.menu.pnum.CH32V203C8.build.IQ_math_RV32=
CH32V20x_EVT.menu.pnum.CH32V203C8.build.ch_extra_lib=-lprintf


#Suzuduino UNO V1b (CH32V203K8T6)
CH32V20x_EVT.menu.pnum.SuzuduinoUNO_V1b=Suzuduino UNO (V1b)
CH32V20x_EVT.menu.pnum.SuzuduinoUNO_V1b.node=NODE_V203C8
CH32V20x_EVT.menu.pnum.SuzuduinoUNO_V1b.upload.maximum_size=65536
CH32V20x_EVT.menu.pnum.SuzuduinoUNO_V1b.upload.maximum_data_size=20480
CH32V20x_EVT.menu.pnum.SuzuduinoUNO_V1b.build.mcu=QingKe-V4B
CH32V20x_EVT.menu.pnum.SuzuduinoUNO_V1b.build.board=CH32V203C8
CH32V20x_EVT.menu.pnum.SuzuduinoUNO_V1b.build.series=CH32V20x
CH32V20x_EVT.menu.pnum.SuzuduinoUNO_V1b.build.variant=CH32V20x/CH32V203C8
CH32V20x_EVT.menu.pnum.SuzuduinoUNO_V1b.build.chip=CH32V203
CH32V20x_EVT.menu.pnum.SuzuduinoUNO_V1b.build.march=rv32imacxw
CH32V20x_EVT.menu.pnum.SuzuduinoUNO_V1b.build.mabi=ilp32
CH32V20x_EVT.menu.pnum.SuzuduinoUNO_V1b.build.math_lib_gcc=-lm 
CH32V20x_EVT.menu.pnum.SuzuduinoUNO_V1b.build.IQ_math_RV32=
CH32V20x_EVT.menu.pnum.SuzuduinoUNO_V1b.build.ch_extra_lib=-lprintf


#SUZUNO32RV (CH32V203C8T6)
CH32V20x_EVT.menu.pnum.SUZUNO32RV=SUZUNO32RV (V1)
CH32V20x_EVT.menu.pnum.SUZUNO32RV.node=NODE_V203C8
CH32V20x_EVT.menu.pnum.SUZUNO32RV.upload.maximum_size=65536
CH32V20x_EVT.menu.pnum.SUZUNO32RV.upload.maximum_data_size=20480
CH32V20x_EVT.menu.pnum.SUZUNO32RV.build.mcu=QingKe-V4B
CH32V20x_EVT.menu.pnum.SUZUNO32RV.build.board=CH32V203C8
CH32V20x_EVT.menu.pnum.SUZUNO32RV.build.series=CH32V20x
CH32V20x_EVT.menu.pnum.SUZUNO32RV.build.variant=CH32V20x/CH32V203C8
CH32V20x_EVT.menu.pnum.SUZUNO32RV.build.chip=CH32V203
CH32V20x_EVT.menu.pnum.SUZUNO32RV.build.march=rv32imacxw
CH32V20x_EVT.menu.pnum.SUZUNO32RV.build.mabi=ilp32
CH32V20x_EVT.menu.pnum.SUZUNO32RV.build.math_lib_gcc=-lm 
CH32V20x_EVT.menu.pnum.SUZUNO32RV.build.IQ_math_RV32=
CH32V20x_EVT.menu.pnum.SUZUNO32RV.build.ch_extra_lib=-lprintf


#Generic CH32V203C6 Board
CH32V20x_EVT.menu.pnum.CH32V203C6=CH32V203C6
CH32V20x_EVT.menu.pnum.CH32V203C6.node=NODE_V203C6
CH32V20x_EVT.menu.pnum.CH32V203C6.upload.maximum_size=32768
CH32V20x_EVT.menu.pnum.CH32V203C6.upload.maximum_data_size=20480
CH32V20x_EVT.menu.pnum.CH32V203C6.build.mcu=QingKe-V4B
CH32V20x_EVT.menu.pnum.CH32V203C6.build.board=CH32V203C6
CH32V20x_EVT.menu.pnum.CH32V203C6.build.series=CH32V20x
CH32V20x_EVT.menu.pnum.CH32V203C6.build.variant=CH32V20x/CH32V203C6
CH32V20x_EVT.menu.pnum.CH32V203C6.build.chip=CH32V203
CH32V20x_EVT.menu.pnum.CH32V203C6.build.march=rv32imacxw
CH32V20x_EVT.menu.pnum.CH32V203C6.build.mabi=ilp32
CH32V20x_EVT.menu.pnum.CH32V203C6.build.math_lib_gcc=-lm 
CH32V20x_EVT.menu.pnum.CH32V203C6.build.IQ_math_RV32=
CH32V20x_EVT.menu.pnum.CH32V203C6.build.ch_extra_lib=-lprintf



# Upload menu
CH32V20x_EVT.menu.upload_method.swdMethod=WCH-SWD
CH32V20x_EVT.menu.upload_method.swdMethod.upload.protocol=
CH32V20x_EVT.menu.upload_method.swdMethod.upload.options=
CH32V20x_EVT.menu.upload_method.swdMethod.upload.tool=WCH_linkE

